# schedule_data.py

from dataclasses import dataclass
from datetime import time
from typing import Dict, List

@dataclass(frozen=True)
class Lesson:
    start: time
    end: time
    title: str

# Время пар
T1 = (time(8, 0),  time(9, 30))
T2 = (time(9, 40), time(11, 10))
T3 = (time(11, 25), time(12, 55))
T4 = (time(13, 20), time(14, 50))
T5 = (time(15, 5), time(16, 35))

# Нумерация дней: 0=Пн ... 6=Вс
WEEK1: Dict[int, List[Lesson]] = {
    0: [
        Lesson(*T1, "Элективная дисциплина по физ.культуре и спорту — семинар"),
        Lesson(*T2, "Основы фин.грам. и фин.безопасности — семинар"),
        Lesson(*T3, "Безопасность жизнедеятельности — лекция"),
    ],
    1: [
        Lesson(*T1, "Математика — семинар"),
        Lesson(*T2, "Математика — лекция"),
        Lesson(*T3, "История России — лекция"),
    ],
    2: [
        Lesson(*T1, "Современные инф.техн. и програм. ср. — семинар"),
        Lesson(*T2, "Современные инф.техн. и програм. ср. — семинар"),
        Lesson(*T3, "Экономическая теория — семинар"),
        Lesson(*T4, "Экономическая теория — лекция"),
    ],
    3: [
        Lesson(*T1, "Элективная дисциплина по физ.культуре и спорту — семинар"),
        Lesson(*T2, "История России — семинар"),
    ],
    4: [],  # Пт выходной
    5: [
        Lesson(*T2, "Деловой иностранный язык — семинар"),
        Lesson(*T3, "Деловой иностранный язык — семинар"),
    ],
    6: [],  # Вс
}

WEEK2: Dict[int, List[Lesson]] = {
    0: [
        Lesson(*T1, "Элективная дисциплина по физ.культуре и спорту — семинар"),
        Lesson(*T2, "Основы фин.грам. и фин.безопасности — семинар"),
        Lesson(*T3, "Основы фин.грам. и фин.безопасности — лекция"),
    ],
    1: [
        Lesson(*T2, "Современные инф.техн. и програм. ср. — семинар"),
        Lesson(*T3, "Математика — семинар"),
        Lesson(*T4, "Безопасность жизнедеятельности — семинар"),
    ],
    2: [
        Lesson(*T1, "Региональное развитие — лекция"),
        Lesson(*T2, "Региональное развитие — семинар"),
        Lesson(*T3, "Экономическая теория — семинар"),
        Lesson(*T4, "Экономическая теория — лекция"),
        Lesson(*T5, "Деловой иностранный язык — семинар"),
    ],
    3: [
        Lesson(*T2, "Математика — лекция"),
        Lesson(*T3, "Региональное развитие — семинар"),
    ],
    4: [],  # Пт выходной
    5: [
        Lesson(*T3, "История России — семинар"),
    ],
    6: [],  # Вс
}
